//Дано масив із N цілих чисел. Знайти найбільшу суму підмасивів довільної довжини, де елементи йдуть підряд

//Ця задача розв'язана навіть без gpt, за допомогою алгоритму Кадане, подібні задачі мені зустрілися кілька разів тому думаю пригодиться на олімпіаді
//Працює ця ху*** наступним чином: 
#include<iostream>
#include<vector>
using namespace std;

int main(){
    int N;
    cin >> N;
    vector<int> a(N);
    for(int i=0; i<N;i++){ cin >> a[i];}
    int current = 0, max = a[0];
    for(int i=0; i<N;i++){
        if(current<=0){
                
        }
    }
    
}
