#include<iostream>
using namespace std;

int main(){
    int h, m, t;
    cout << "Введіть час" << endl;
    cin >> h >> m;    
    if(h>24){
        cout << "В добі немає більше 24 годин" << endl;
    } else if(m>60){
        cout << "В годині немає більше 60 хвилин" << endl;
    } else {
       if(h<7 || h>=23){
            cout << "Доведеться зачекати 7:00 та піти в крамницю" << endl;
       } else if (h>=7 && h<13 || h>14 && h<19 || h==14 && m>40){
           cout << "Найшвидше буде сходити в крамницю" << endl;
       } else if (h==13 && m<40 || h==19 && m<40){
           cout << "Найшвидше бути сходити в гастроном" << endl;
       } else if(h>20){
           if (h == 22 && m<15){
               cout << "Найшвидше буде сходити в супермаркет" << endl;
           } else if(h<22){
           cout << "Найшвидше буде сходити в супермаркет" << endl;
           } else {cout << "Доведеться зачекати 7:00 та піти в крамницю" << endl;}
       }
    }
}

