#include<iostream>
using namespace std;

int main(){
    short num;
    cout << "Введіть номер завдання \n 0-Задача про потяг \n 1-Задача про квиток в кіно" << endl;
    cin >> num;
    if (num > 1){
        cout << "Такої опції немає" << endl;
    } else if(num == 0){
        float v, d, p, s;
        cout << "Введіть ціну квитка (грн)"<< endl;
        cin >> p;
        cout << "Введіть ваш баланс (грн)" << endl;
        cin >> s;
        if(s==0){
        cout << "Чого ви взагалі сюди прийшли?" << endl; 
        } else if(s<p){
            cout << "У вас недостатньо коштів щоб придбати квиток" << endl;
        } else if(s>p){
            cout << "Введіть відстань (км)" << endl;
            cin >> d;
            cout << "Введіть швидкість (км/год)" << endl;
            cin >> v;
            cout << "Ви прибудете о " << (int)(d/v+7) << " годині (цілочисельно)" << endl;
            cout << "Після купівлі квитка у вас залишиться " << s-p << " гривень" << endl;
        }
    } else if(num == 1){
        float a, b, k, s;
        cout << "Введіть ціну квитка (грн)" << endl;   
        cin >> a;
        if (a==0){
            cout << "Звідки у вас безкоштовні квитки?" << endl;
        }
        cout << "Введіть ціну попкорну (грн)" << endl;
        cin >> b;
        if (b==0&&a==0){
            cout << "Навіщо вам взагалі ця програма якщо в вас все безкоштовно?" << endl;
            return 0;
        } else if (b==0&&a>0) {
            cout << "Де ви знайшли безкоштовний попкорн?" << endl;
        }
        cout << "Введіть кількість осіб в компанії" << endl;
        cin >> k;
        cout << "Введіть баланс компанії (грн)" << endl;
        cin >> s;
        if ((a*k)>s){
            cout << "Вам не вистачить коштів щоб купити квитки усім" << endl;
        } else if((a*k)<s){
            if(((a+b)*k)>s){
            cout << "Вам вистачить на квиткви, але не вистачить на попкорн \n Після купівлі квитків у вас залишиться " << s-a*k << " гривень" << endl;
            } else if(((a+b)*k)<s){
            cout << "Вам вистачить і на квитки, і на попкорн \n Після купівлі квитків і попкорну у вас залишиитmся " << s-(a+b)*k << " гривень" << endl;
            }
        }
    }
}
